

Question 6: Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [13]:
import pandas as pd
import numpy as np

data  = {'name': ['parth', 'Rohan', 'Jayu', 'viru', 'mango', 'orange', 'science', 'physic', 'kerla', 'uk'],
        'score': [66, 49, 16.5, 45, 9, 20, 14.5, 78, 8, 19],}
insex = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data , index=insex)
print(df)

      name  score
a    parth   66.0
b    Rohan   49.0
c     Jayu   16.5
d     viru   45.0
e    mango    9.0
f   orange   20.0
g  science   14.5
h   physic   78.0
i    kerla    8.0
j       uk   19.0



Question 7: Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [12]:
import pandas as pd
import numpy as np

data  = {'name': ['parth', 'Rohan', 'Jayu', 'viru', 'mango', 'orange', 'science', 'physic', 'kerla', 'uk'],
        'score': [66, 49, 16.5, 45, 9, 20, 14.5, 78, 8, 19],}
insex = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']


df = pd.DataFrame(data , index=insex)
print("Select specific columns:")
print(df[['name', 'score']])

Select specific columns:
      name  score
a    parth   66.0
b    Rohan   49.0
c     Jayu   16.5
d     viru   45.0
e    mango    9.0
f   orange   20.0
g  science   14.5
h   physic   78.0
i    kerla    8.0
j       uk   19.0



Question 8: Write a Pandas program to join the two given dataframes along rows and assign all data.

In [17]:
import pandas as pd

data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['parth', 'Rohan', 'Jayu', 'viru', 'mango',], 
        'marks': [200, 210, 190, 222, 199]})

data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['orange', 'science', 'physic', 'kerla', 'uk'], 
        'marks': [201, 200, 198, 219, 201]})

print("Original DataFrames:")
print(data1)
print("-------------------------------------")
print(data2)
print("joining the 2 data set")
result_data = pd.concat([data1, data2])
print(result_data)

Original DataFrames:
  student_id   name  marks
0         S1  parth    200
1         S2  Rohan    210
2         S3   Jayu    190
3         S4   viru    222
4         S5  mango    199
-------------------------------------
  student_id     name  marks
0         S4   orange    201
1         S5  science    200
2         S6   physic    198
3         S7    kerla    219
4         S8       uk    201
joining the 2 data set
  student_id     name  marks
0         S1    parth    200
1         S2    Rohan    210
2         S3     Jayu    190
3         S4     viru    222
4         S5    mango    199
0         S4   orange    201
1         S5  science    200
2         S6   physic    198
3         S7    kerla    219
4         S8       uk    201



Question 9: Write a Pandas program to detect missing values of a given DataFrame. Display True or False.

In [18]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})
print("Original Orders DataFrame:")
print(df)
print("\nMissing values of the said dataframe:")
print(df.isna())

Original Orders DataFrame:
     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

Missing values of the said dataframe:
    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True



Question 10: Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [23]:
data = [66,88,44,99.2,55.1,]  
a = pd.Series(data) 
print(a)

0    66.0
1    88.0
2    44.0
3    99.2
4    55.1
dtype: float64